app/controllers/songs_controller.rb

  def new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."artist_id" = '1' LIMIT 1
SELECT  1 AS one FROM "artists" LIMIT 1